class Breed < ActiveHash::Base
  self.data = [
    { id: 0, name: '__' },
    { id: 1, name: '混血猫' },
    { id: 2, name: 'スコティッシュ・フォールド' },
    { id: 3, name: 'アメリカン・ショートヘア' },
    { id: 4, name: ' マンチカン' },
    { id: 5, name: '日本猫' },
    { id: 6, name: 'ノルウェージャン・フォレスト・キャット' },
    { id: 7, name: ' ロシアンブルー' },
    { id: 8, name: 'ブリティッシュ・ショートヘア' },
    { id: 9, name: 'ラグドール' },
    { id: 10, name: 'メイン・クーン' },
    { id: 11, name: 'ペルシャ（チンチラ）' },
    { id: 12, name: 'ベンガル' },
    { id: 13, name: 'ソマリ' },
    { id: 14, name: 'アビシニアン' },
    { id: 15, name: 'アメリカン・カール' },
    { id: 16, name: 'ペルシャ' },
    { id: 17, name: 'スコティッシュ・フォールド・ロングヘア' },
    { id: 18, name: 'ラガマフィン' },
    { id: 19, name: 'エキゾチック・ショートヘア' },
    { id: 20, name: 'シンガプーラ' },
    { id: 21, name: 'その他' }
  ]
end
